In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:123@localhost/soccer

In [3]:
%%sql
--- ilk 5 kaydın bütün alanları
SELECT * 
    FROM player
    LIMIT 5;

 * postgresql://postgres:***@localhost/soccer
5 rows affected.

[(1, 505942, 'Aaron Appindangoye', datetime.date(1992, 2, 29), 182.88, 187),
 (2, 155782, 'Aaron Cresswell', datetime.date(1989, 12, 15), 170.18, 146),
 (3, 162549, 'Aaron Doran', datetime.date(1991, 5, 13), 170.18, 163),
 (4, 30572, 'Aaron Galindo', datetime.date(1982, 5, 8), 182.88, 198),
 (5, 23780, 'Aaron Hughes', datetime.date(1979, 11, 8), 182.88, 154)]

In [4]:
%%sql
--- ilk 5 kaydın isim,boy,kilo alanları
SELECT 
    player_name,
    height,
    weight 
    FROM player
    LIMIT 5;

 * postgresql://postgres:***@localhost/soccer
5 rows affected.

[('Aaron Appindangoye', 182.88, 187),
 ('Aaron Cresswell', 170.18, 146),
 ('Aaron Doran', 170.18, 163),
 ('Aaron Galindo', 182.88, 198),
 ('Aaron Hughes', 182.88, 154)]

In [5]:
%%sql
--- ilk 5 kaydın isimleri
SELECT 
    player_name AS "Name"
    FROM player
    LIMIT 5;

 * postgresql://postgres:***@localhost/soccer
5 rows affected.

[('Aaron Appindangoye',),
 ('Aaron Cresswell',),
 ('Aaron Doran',),
 ('Aaron Galindo',),
 ('Aaron Hughes',)]

In [6]:
%%sql
--- 190 cmden uzun 159 lbden zayıf ilk 5 kaydın id,isim,boy ve kilo alanları
SELECT
    player_api_id AS id,
    player_name AS Name,
    height,
    weight
    FROM player
    WHERE height>190 AND weight<159
    LIMIT 5;

 * postgresql://postgres:***@localhost/soccer
5 rows affected.

[(451335, 'Edmilson Fernandes', 190.5, 154),
 (144989, 'Efe Ambrose', 190.5, 154),
 (36783, 'Kyle Lafferty', 193.04, 154),
 (119760, 'Rasmus Joensson', 193.04, 154),
 (575789, 'Reece Oxford', 190.5, 157)]

In [7]:
%%sql
--- api_idleri 15000 ile 15500 arasında olan ilk 5 kaydın id,isim,boy ve kilo alanları
SELECT
    player_api_id AS id,
    player_name AS Name,
    height,
    weight
    FROM player 
    WHERE player_api_id BETWEEN 15000 AND 15500
    LIMIT 5;

 * postgresql://postgres:***@localhost/soccer
4 rows affected.

[(15403, 'Edin Dzeko', 193.04, 185),
 (15361, 'Jasmin Buric', 193.04, 183),
 (15456, 'Josip Barisic', 193.04, 185),
 (15425, 'Veldin Muharemovic', 182.88, 170)]

In [8]:
%%sql
--- isminde -io- bulunan ilk 5 kaydın api_id,isim,boy ve kilo alanları
SELECT
    player_api_id AS id,
    player_name AS Name,
    height,
    weight
    FROM player 
    WHERE player_name LIKE '%io%'
    LIMIT 5;

 * postgresql://postgres:***@localhost/soccer
5 rows affected.

[(194479, 'Abdoulaye Diallo Sadio,22', 182.88, 168),
 (114503, 'Abiola Dauda', 180.34, 165),
 (306507, 'Adam Pazio', 182.88, 159),
 (131409, 'Adlene Guedioura', 177.8, 179),
 (323385, 'Adrian Ricardo Centurion', 175.26, 143)]

In [9]:
%%sql
--- player_api_id azalan sırada olacak şekilde; boyu 180 cmden uzun olan ilk 5 kaydın bütün alanları
SELECT 
    * FROM player
    WHERE height>180
    ORDER BY player_api_id DESC
    LIMIT 5;

 * postgresql://postgres:***@localhost/soccer
5 rows affected.

[(3607, 748432, 'Fynn Arkenberg', datetime.date(1996, 3, 4), 187.96, 176),
 (1665, 743720, 'Charles Pickel', datetime.date(1997, 5, 15), 185.42, 176),
 (5575, 728414, 'Justin Hoogma', datetime.date(1998, 6, 11), 182.88, 143),
 (1619, 726956, 'Cedric Itten', datetime.date(1996, 12, 27), 185.42, 176),
 (2571, 725718, 'Dennis van der Heijden', datetime.date(1997, 2, 17), 193.04, 165)]